a={'0001': '姓名：胡觜  学号:2023003360', '0002': '姓名：小李  学号:2023003361', '0003': '姓名：小方  学号:2023003369',
   '0004': '姓名：小纪  学号:2023003362', '0005': '姓名：小崔  学号:2023003363', '0006': '姓名：小康  学号:2023003364',
   '0007': '姓名：小刘  学号:2023003365', '0008': '姓名：小雷  学号:2023003366', '0009': '姓名：小赵  学号:2023003367',
    '0010': '姓名：小钱  学号:2023003368'}#人员

d={'0001': 0, '0002': 0, '0003': 0,
   '0004': 0, '0005': 0, '0006': 0,
   '0007': 0, '0008': 0, '0009': 0,
   '0010': 0}#人员

print('开始检录！')
while True:
    b=input('扫码检录')
    if b in a:
        if d[b]==0:
            d[b]+=1
        else:
            print('该同学已检录')
        #print(a[b]+'\t已检录')
        print(a[b])
        n = 0
        for key,value in d.items():#记录人员
            #print(value)
            n+=value
        c=input(f'已检录{n}人 （回车继续/按y回车查看详情）')

        if c == 'y':
            for key, value in a.items():  # -----------打印字典!!!-前面必须是key,和value才会输出对应值
                if d[key] != 0:
                    print(f'{key}\t{value}\t已检录')
                else:
                    print(f'{key}\t{value}\t未检录')
        e=input('是否继续检录？ 回车继续/按n回车结束检录')
        if e=='':
            continue#从头开始循环
        else:
            print('检录状态如下：')
            for key, value in a.items():#打印检录状态
                print(f'{key}:{value}')
            break
    else:
        print('无该人员，请再试一次')
        continue


