
a={}
while True:
    b=input('码')
    name='姓名：'
    c=input('姓名')
    name+=c
    xue='  学号:'
    d=input('学号')
    total=name+xue+d
    a[b]=total

    print(a)

a={'0001': '姓名：胡觜  学号:2023003360', '0002': '姓名：小李  学号:2023003361', '0003': '姓名：小方  学号:2023003369',
   '0004': '姓名：小纪  学号:2023003362', '0005': '姓名：小崔  学号:2023003363', '0006': '姓名：小康  学号:2023003364',
   '0007': '姓名：小刘  学号:2023003365', '0008': '姓名：小雷  学号:2023003366', '0009': '姓名：小赵  学号:2023003367',
    '0010': '姓名：小钱  学号:2023003368'}
