import turtle as t

a = {'红心A': '♥\nA', '红心2': '♥\n2', '红心3': '♥\n3', '红心4': '♥\n4', '红心5': '♥\n5', '红心6': '♥\n6',
     '红心7': '♥\n7',
     '红心8': '♥\n8', '红心9': '♥\n9', '红心10': '♥\n10', '红心J': '♥\nJ', '红心Q': '♥\nQ', '红心K': '♥\nK',
     '方块A': '♦\nA',
     '方块2': '♦\n2', '方块3': '♦\n3', '方块4': '♦\n4.', '方块5': '♦\n5', '方块6': '♦\n6', '方块7': '♦\n7',
     '方块8': '♦\n8',
     '方块9': '♦\n9', '方块10': '♦\n10', '方块J': '♦\nJ', '方块Q': '♦\nQ', '方块K': '♦\nK', '梅花A': '♣\nA',
     '梅花2': '♣\n2',
     '梅花3': '♣\n3', '梅花4': '♣\n4', '梅花5': '♣\n5', '梅花6': '♣\n6', '梅花7': '♣\n7', '梅花8': '♣\n8',
     '梅花9': '♣\n9',
     '梅花10': '♣\n10', '梅花J': '♣\nJ', '梅花Q': '♣\nQ', '梅花K': '♣\nK', '黑桃A': '♠\nA', '黑桃2': '♠\n2',
     '黑桃3': '♠\n3',
     '黑桃4': '♠\n4', '黑桃5': '♠\n5', '黑桃6': '♠\n6', '黑桃7': '♠\n7', '黑桃8': '♠\n8', '黑桃9': '♠\n9',
     '黑桃10': '♠\n10',
     '黑桃J': '♠\nJ', '黑桃Q': '♠\nQ', '黑桃K': '♠\nK', '小王': 'jo\nke', '大王': 'JO\nKE'}

A = [-150, 225, 300, 450, 200, 75]




def move(x, y):
    t.pu()
    t.goto(x, y)
    t.pd()


def Card(card):
    move(A[0], A[1])
    for i in range(4):
        t.fd(A[2])
        t.right(90)
        t.fd(A[3])
        t.right(90)
    t.right(90)
    t.fd(A[4])
    if '红' or '方' in b:
        t.color('red')
        t.write(card, font=('宋体', A[5], 'normal'))
    else:
        t.write(card, font=('宋体', A[5], 'normal'))

t.hideturtle()
t.width(3)
b = input('输入牌名')
t.tracer(0)
Card(a[b])
t.tracer(1)
t.done()
