import turtle

import turtle as t
game=t.Screen()
game.title('走迷宫')#取名
game.bgcolor('skyblue')#设置背景颜色
game.setup(800,600)#游戏窗口大小

#--------------------------------------------

def move(x,y):
    b.up()
    b.goto(x,y)
    b.down()
def line(x1,y1,x2,y2):#划线
     move(x1,y1)
     b.goto(x2,y2)

b=t.Pen()
b.pensize(15)#设置笔粗细
b.hideturtle()

turtle.tracer(False)
'''
#上边线 
line(-300,200,300,200)
line(-300,200,-300,50)
line(300,200,300,50)
#上齿
line(0,200,0,-75)
line(-200,200,-200,-75)
line(200,200,200,-75)

line(-300,-200,300,-200)
line(-300,-200,-300,-50)
line(300,-200,300,-50)

line(-100,-200,-100,75)
line(100,-200,100,75)
'''
#改为数据驱动

A=[[-300,200,300,200],[-300,200,-300,50],[300,200,300,50],[0,200,0,-75],[-200,200,-200,-75],[200,200,200,-75],
   [-300,-200,300,-200],[-300,-200,-300,-50],[300,-200,300,-50],[-100,-200,-100,75],[100,-200,100,75]]#存放数据

for i in range(11):
    line(A[i][0],A[i][1],A[i][2],A[i][3])

turtle.tracer(True)
t.done()

