import jieba#结巴
f=open('论语解读版本.txt','r',encoding='utf-8')#原版
f2=open('原文.txt','w')
A=['【','】','1猜','2弹幕','3小学算术','4.进度条','5','6','7','8','9','0','(',')','/','_']#不符合规范的开头
#---------------------------------------------------------------------------------------------
#print(f.readlines())

a = f.readline()
while a!='':#一行一行读取判断是否是原文
    if a=='\n':#空行跳过
        a = f.readline()
    else:
        if a[2:3] not in A:#规范，a的第三个字符串开始

            #--------------------------------------------------------------
            k=jieba.lcut(a,cut_all=False)#切词，精简
            b=''
            for i in k:
                if i not in A:
                    b+=i
            b+='\n'
            #-------------------------------------------------------------

            f2.write(b)
            a = f.readline()
        else:
            a = f.readline()
f2.close()
f.close()


