problem={'操':'曹操','李典': ' 李典 ', '曹仁': ' 曹仁 ', '曹洪': ' 曹洪 ', '荀攸': ' 荀攸 ', '郭嘉': ' 郭嘉 ', '刘晔': ' 刘晔 ', '孙乾': ' 孙乾 ', '简雍': ' 简雍 ', '糜竺': ' 糜竺 ', '满宠': ' 满宠 ', '吕虔': ' 吕虔 ', '毛玠': ' 毛玠 ', '于禁': ' 于禁 ', '程普': ' 程普 ', '黄盖': ' 黄盖 ', '韩当': ' 韩当 ', '祖茂': ' 祖茂 ', '朱治': ' 朱治 ', '吕范': ' 吕范 ', '张昭': ' 张昭 ', '张纮': ' 张纮 ', '蒋钦': ' 蒋钦 ', '周泰': ' 周泰 ', '陈武': ' 陈武 ', '虞翻': ' 虞翻 ', '董袭': ' 董袭 ', '许褚': ' 许褚 ', '徐晃': ' 徐晃 ', '董昭': ' 董昭 ', '张辽': ' 张辽 ', '臧霸': ' 臧霸 ', '李通': ' 李通 ', '陈登': ' 陈登 ', '顾雍': ' 顾雍 ', '张郃': ' 张郃 ', '许攸': ' 许攸 ', '贾诩': ' 贾诩 ', '文聘': ' 文聘 ', '魏延': ' 魏延 ', '徐庶': ' 徐庶 ', '庞统': ' 庞统 ', '严畯': ' 严畯 ', '陆绩': ' 陆绩 ', '张温': ' 张温 ', '骆统': ' 骆统 ', '吾粲': ' 吾粲 ', '徐盛': ' 徐盛 ', '潘璋': ' 潘璋 ', '丁奉': ' 丁奉 ', '步骘': ' 步骘 ', '陆逊': ' 陆逊 ', '凌统': ' 凌统 ', '马谡': ' 马谡 ', '蒋琬': ' 蒋琬 ', '廖化': ' 廖化 ', '薛综': ' 薛综 ', '程秉': ' 程秉 ', '朱桓': ' 朱桓 ', '蒋干': ' 蒋干 ', '王粲': ' 王粲 ', '陈琳': ' 陈琳 ', '崔琰': ' 崔琰 ', '阚泽': ' 阚泽 ', '陈震': ' 陈震 ', '伊籍': ' 伊籍 ', '张松': ' 张松 ', '杨修': ' 杨修 ', '陈群': ' 陈群 ', '法正': ' 法正 ', '孟达': ' 孟达 ', '曹休': ' 曹休 ', '孙翊': ' 孙翊 ', '孙匡': ' 孙匡 ', '孙朗': ' 孙朗 ', '孙韶': ' 孙韶 ', '孙静': ' 孙静 ', '刘巴': ' 刘巴 ', '彭羕': ' 彭羕 ', '费祎': ' 费祎 ', '傅巽': ' 傅巽 ', '刘馥': ' 刘馥 ', '张既': ' 张既 ', '李严': ' 李严 ', '霍峻': ' 霍峻 ', '董和': ' 董和 ', '李恢': ' 李恢 ', '秦宓': ' 秦宓 ', '谯周': ' 谯周 ', '傅干': ' 傅干 ', '曹彰': ' 曹彰 ', '管恪': ' 管恪 ', '耿纪': ' 耿纪 ', '左慈': ' 左慈 ', '吉邈': ' 吉邈 ', '吉穆': ' 吉穆 ', '赵咨': ' 赵咨 ', '孙桓': ' 孙桓 ', '孙皎': ' 孙皎 ', '邓芝': ' 邓芝 ', '刘永': ' 刘永 ', '刘理': ' 刘理 ', '丁仪': ' 丁仪 ', '丁廙': ' 丁廙 ', '吉太': ' 吉太 ', '王连': ' 王连 ', '吕凯': ' 吕凯 ', '姜维': ' 姜维 ', '曹睿': ' 曹睿 ', '郭淮': ' 郭淮 ', '曹真': ' 曹真 ', '郝昭': ' 郝昭 ', '全琮': ' 全琮 ', '诸葛恪': ' 诸葛恪 ', '王双': ' 王双 ', '辛毗': ' 辛毗 ', '宗预': ' 宗预 ', '夏侯惠': ' 夏侯惠 ', '曹芳': ' 曹芳 ', '何晏': ' 何晏 ', '邓飏': ' 邓飏 ', '李胜': ' 李胜 ', '丁谧': ' 丁谧 ', '毕轨': ' 毕轨 ', '桓范': ' 桓范 ', '邓艾': ' 邓艾 ', '诸葛瞻': ' 诸葛瞻 ', '曹髦': ' 曹髦 ', '曹奂': ' 曹奂 ', '毌丘俭': ' 毌丘俭 ', '贾充': ' 贾充 ', '孙峻': ' 孙峻 ', '孙綝': ' 孙綝 ', '孙休': ' 孙休 ', '孙皓': ' 孙皓 ', '诸葛诞': ' 诸葛诞 ', '羊祜': ' 羊祜 ', '刘协': ' 刘协 ', '丁原': ' 丁原 ', '伍孚': ' 伍孚 ', '陈宫': ' 陈宫 ', '袁术': ' 袁术 ', '郑玄': ' 郑玄 ', '陶谦': ' 陶谦 ', '蒯越': ' 蒯越 ', '蒯良': ' 蒯良 ', '陈翔': ' 陈翔 ', '范谤': ' 范谤 ', '孔昱': ' 孔昱 ', '范康': ' 范康 ', '檀敷': ' 檀敷 ', '张俭': ' 张俭 ', '岑眰': ' 岑眰 ', '刘繇': ' 刘繇 ', '审配': ' 审配 ', '袁谭': ' 袁谭 ', '袁熙': ' 袁熙 ', '袁尚': ' 袁尚 ', '刘璋': ' 刘璋 ', '马腾': ' 马腾 ', '司马徽': ' 司马徽 ', '杨阜': ' 杨阜 ', '胡邈': ' 胡邈 ', '逢纪': ' 逢纪 ', '张裔': ' 张裔 ', '庞德公': ' 庞德公 ', '蔡邕': ' 蔡邕 ', '韩遂': ' 韩遂 ', '马钧': ' 马钧 ', '曹爽': ' 曹爽 ', '黄琬': ' 黄琬 ', '张鲁': ' 张鲁 ', '陈珪': ' 陈珪 ', '秦朗': ' 秦朗 ', '刘焉': ' 刘焉 ', '刘岱': ' 刘岱 ', '华歆': ' 华歆 ', '何进': ' 何进 ', '卢植': ' 卢植 ', '山涛': ' 山涛 ', '王朗': ' 王朗 ', '管宁': ' 管宁 ', '金祎': ' 金祎 '}

# with open('人物3.txt', 'r', encoding='utf-8') as f:
#     A = f.readlines()
#     people_names = {}
#     people_say_times={}
#     for i in range(len(A)):
#         if A[i] == '\n':
#             continue
#         else:
#             A[i]=A[i].strip(' \n')
#             person=A[i].split('字')
#             people_names[person[0]]=person[1]
#             people_say_times[person[0]]=0
#
#     print(people_names)
#     print(people_say_times)
#     people_say_words=people_say_times.copy()
#
# with open('sg（原文）utf-8.txt','r',encoding='utf-8') as f:
#     f0=open('原文改人名.txt','w',encoding='utf-8')
#     for sentence in f:
#         for key,value in C.items():
#             sentence = sentence.replace(key, value)
#         for key,value in people_names.items():
#             sentence=sentence.replace(value,key)
#         for key,value in Data.problem.items():
#             sentence = sentence.replace(key, value)
#         f0.write(sentence)
#     f0.close()
#
# with open('原文改人名.txt','r',encoding='utf-8') as f:
#     for i in range(7500):
#         names=[]
#         sentence=''
#         word=''
#
#         while True:
#             word=f.read(1)
#             sentence+=word
#             if word=='曰':
#                 i=f.read(2)
#                 if i=='："':
#                     break
#         key_sentence=re.findall(r'(.{0,15})(曰)',sentence)
#         for i in range(len(key_sentence)):
#             key_list=jieba.lcut(key_sentence[i][0],cut_all=True)
#             for name in key_list:
#                 if name in people_names:
#                     people_say_times[name]+=1
#                     names.append(name)
#         words=''
#         while word!='"':
#             word=f.read(1)
#             words+=word
#         for name in names:
#             people_say_words[name]+=len(words)
#
#
# max_times=sorted(people_say_times.items(),key=lambda x:(x[1],x[0]),reverse=True)
# max_words=sorted(people_say_words.items(),key=lambda x:(x[1],x[0]),reverse=True)
# print(max_times)
# print(max_words)
#
